### SQL Cheat Sheet

---

#### **SELECT, FROM**
**Syntax:**  
```sql
SELECT column1, column2 FROM table;
```
**Example:**
```sql
SELECT * FROM players;
SELECT name, dob FROM players;
SELECT DISTINCT team_id FROM players;
SELECT COUNT(*) FROM players;
SELECT COUNT(DISTINCT team_id) FROM players;
SELECT name AS player_name, dob FROM players;
SELECT name player_name, dob FROM players;
```
---

#### **WHERE**
**Syntax:**
```sql
SELECT column1 FROM table WHERE condition;
```
**Example:**
```sql
SELECT name, dob FROM players WHERE dob > '2003-01-01';
SELECT name, team_id FROM players WHERE team_id = 'T0001';
SELECT name, team_id FROM players WHERE team_id IN ('T0001', 'T0002');
SELECT name, dob FROM players WHERE dob BETWEEN '2000-01-01' AND '2003-01-01';
SELECT name FROM players WHERE name LIKE 'J%';
SELECT name FROM players WHERE name LIKE '_a%';
SELECT name, team_id FROM players WHERE name LIKE 'J%' AND team_id = 'T0005';
```

#### **ORDER BY**
**Syntax:**  
```sql
SELECT column1 FROM table ORDER BY column1 [ASC|DESC];
```
**Example:**
```sql
SELECT name, dob FROM players ORDER BY name DESC;
SELECT name, team_id FROM players ORDER BY team_id, name;
SELECT name, team_id FROM players ORDER BY team_id DESC, name;
```

---

#### **LIMIT**
**Syntax:**  
```sql
SELECT column1 FROM table LIMIT number;
```
**Example:**  
```sql
SELECT name, dob FROM players LIMIT 5;
SELECT name, dob FROM players ORDER BY dob DESC LIMIT 10;
```

---

#### **GROUP BY**
**Syntax:**
```sql
SELECT column1, aggregate_function(column2) FROM table GROUP BY column1;
```
**Example:**  
```sql
SELECT team_id FROM players GROUP BY team_id;
SELECT team_id FROM players GROUP BY team_id ORDER BY team_id;
SELECT team_id, COUNT(team_id) FROM players GROUP BY team_id ORDER BY team_id;
SELECT host_team_score, COUNT(host_team_score) FROM matches GROUP BY host_team_score;
```

---

#### **HAVING**
**Syntax:**  
```sql
SELECT column1, aggregate_function(column2) FROM table GROUP BY column1 HAVING condition;
```
**Example:**  
```sql
SELECT host_team_score, COUNT(host_team_score) FROM matches
GROUP BY host_team_score HAVING COUNT(host_team_score) >= 3;
```

---

#### **UNION**
**Syntax:**  
```sql
SELECT column1 FROM table1
UNION
SELECT column1 FROM table2;
```
**Example:**  
```sql
SELECT name FROM players;
UNION
SELECT name FROM managers
```

---

#### **INTERSECT**
**Syntax:**  
```sql
SELECT column1 FROM table1
INTERSECT
SELECT column1 FROM table2;
```
**Example:**  
```sql
SELECT name FROM players
INTERSECT
SELECT name FROM managers;

SELECT * FROM players WHERE dob > '2004-01-01'
INTERSECT
SELECT * FROM players WHERE team_id = 'T0001'
```

---

#### **EXCEPT**
**Syntax:**  
```sql
SELECT column1 FROM table1
EXCEPT
SELECT column1 FROM table2;
```
**Example:**  
```sql
SELECT * FROM players WHERE dob > '2004-01-01'
EXCEPT
SELECT * FROM players WHERE name LIKE 'A%' OR name LIKE 'S%';
```